cmsis-svd/cmsis-svd/data/Spansion/MB9AFB4xL.svd
        <!-- REGISTER "LCDRAM19" -->
        <register>
          <name>LCDRAM19</name>
          <description>Display Data Memory Register 19</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 19</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM20" -->
        <register>
          <name>LCDRAM20</name>
          <description>Display Data Memory Register 20</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 20</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM21" -->
        <register>
          <name>LCDRAM21</name>
          <description>Display Data Memory Register 21</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 21</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM22" -->
        <register>
          <name>LCDRAM22</name>
          <description>Display Data Memory Register 22</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 22</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM23" -->
        <register>
          <name>LCDRAM23</name>
          <description>Display Data Memory Register 23</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 23</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM24" -->
        <register>
          <name>LCDRAM24</name>
          <description>Display Data Memory Register 24</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 24</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM25" -->
        <register>
          <name>LCDRAM25</name>
          <description>Display Data Memory Register 25</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 25</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM26" -->
        <register>
          <name>LCDRAM26</name>
          <description>Display Data Memory Register 26</description>
          <addressOffset>0x36</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 26</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM27" -->
        <register>
          <name>LCDRAM27</name>
          <description>Display Data Memory Register 27</description>
          <addressOffset>0x37</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 27</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
